### Terraform Plan Output Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  
  ```terraform

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.fe-loadbalancer.data.azurerm_resource_group.azlb will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "azlb" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "rsi-dev-rg"
      + tags       = (known after apply)
    }

  # module.fe-loadbalancer.azurerm_lb.azlb will be updated in-place
  ~ resource "azurerm_lb" "azlb" {
        id                   = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb"
        name                 = "fe-lb"
        tags                 = {
            "Component"   = "Frontend"
            "Region"      = "uk south"
            "Terraform"   = "true"
            "environment" = "dev"
        }
        # (6 unchanged attributes hidden)

      ~ frontend_ip_configuration {
            id                            = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/frontendIPConfigurations/myPublicIP"
            name                          = "myPublicIP"
          ~ private_ip_address_allocation = "Static" -> "Dynamic"
          + public_ip_address_id          = (known after apply)
            # (7 unchanged attributes hidden)
        }
    }

  # module.fe-loadbalancer.azurerm_public_ip.azlb[0] will be created
  + resource "azurerm_public_ip" "azlb" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "fe-lb-pip"
      + resource_group_name     = "rsi-dev-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Component"   = "Frontend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
    }

  # module.nsg-public.azurerm_network_security_group.nsg will be destroyed
  # (because azurerm_network_security_group.nsg is not in configuration)
  - resource "azurerm_network_security_group" "nsg" {
      - id                  = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-public" -> null
      - location            = "uksouth" -> null
      - name                = "rsi-nsg-public" -> null
      - resource_group_name = "rsi-dev-rg" -> null
      - security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = "HTTP"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "HTTP"
              - priority                                   = 101
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "HTTPS"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "443"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "HTTPS"
              - priority                                   = 201
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Deny"
              - description                                = "default-deny"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = ""
              - destination_port_ranges                    = [
                  - "0-65535",
                ]
              - direction                                  = "Inbound"
              - name                                       = "DENY"
              - priority                                   = 4096
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> null
      - tags                = {
          - "Component"   = "Frontend"
          - "Public"      = "true"
          - "Region"      = "uk south"
          - "Terraform"   = "true"
          - "environment" = "dev"
        } -> null
    }

  # module.nsg-public.azurerm_network_security_rule.custom_rules[0] will be destroyed
  # (because azurerm_network_security_rule.custom_rules is not in configuration)
  - resource "azurerm_network_security_rule" "custom_rules" {
      - access                                     = "Deny" -> null
      - description                                = "default-deny" -> null
      - destination_address_prefix                 = "*" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_ranges                    = [
          - "0-65535",
        ] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-public/securityRules/DENY" -> null
      - name                                       = "DENY" -> null
      - network_security_group_name                = "rsi-nsg-public" -> null
      - priority                                   = 4096 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "rsi-dev-rg" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
    }

  # module.nsg-public.azurerm_network_security_rule.predefined_rules[0] will be destroyed
  # (because azurerm_network_security_rule.predefined_rules is not in configuration)
  - resource "azurerm_network_security_rule" "predefined_rules" {
      - access                                     = "Allow" -> null
      - description                                = "HTTP" -> null
      - destination_address_prefix                 = "*" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "80" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-public/securityRules/HTTP" -> null
      - name                                       = "HTTP" -> null
      - network_security_group_name                = "rsi-nsg-public" -> null
      - priority                                   = 101 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "rsi-dev-rg" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
    }

  # module.nsg-public.azurerm_network_security_rule.predefined_rules[1] will be destroyed
  # (because azurerm_network_security_rule.predefined_rules is not in configuration)
  - resource "azurerm_network_security_rule" "predefined_rules" {
      - access                                     = "Allow" -> null
      - description                                = "HTTPS" -> null
      - destination_address_prefix                 = "*" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "443" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-public/securityRules/HTTPS" -> null
      - name                                       = "HTTPS" -> null
      - network_security_group_name                = "rsi-nsg-public" -> null
      - priority                                   = 201 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "rsi-dev-rg" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
    }

  # module.rsi-vnet-fe.azurerm_subnet.subnet_for_each["public"] will be destroyed
  # (because key ["public"] is not in for_each map)
  - resource "azurerm_subnet" "subnet_for_each" {
      - address_prefixes                               = [
          - "10.0.1.0/24",
        ] -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/public" -> null
      - name                                           = "public" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "rsi-dev-rg" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      - virtual_network_name                           = "rsi-fe-vnet" -> null
    }

  # module.rsi-vnet-fe.azurerm_subnet_network_security_group_association.vnet["public"] will be destroyed
  # (because key ["public"] is not in for_each map)
  - resource "azurerm_subnet_network_security_group_association" "vnet" {
      - id                        = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/public" -> null
      - network_security_group_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-public" -> null
      - subnet_id                 = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/public" -> null
    }

  # module.rsi-vnet-fe.azurerm_subnet_route_table_association.vnet["public"] will be destroyed
  # (because key ["public"] is not in for_each map)
  - resource "azurerm_subnet_route_table_association" "vnet" {
      - id             = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/public" -> null
      - route_table_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/routeTables/rsi-rt-fe" -> null
      - subnet_id      = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/public" -> null
    }

Plan: 1 to add, 1 to change, 7 to destroy.

Changes to Outputs:
  ~ fe-subnets = [
        # (1 unchanged element hidden)
        "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/frontend",
      - "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/public",
    ]

  ```
  </details>
  
  *Pusher: @MartyFox, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Pull Request Plan`*